Revit 2026 API

# CableTraySettingsSizeSeparator Property

---

The cable tray size separator string.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SizeSeparator { get; set; }
```
```vb
Public Property SizeSeparator As String
	Get
	Set
```
```cpp
public:
property String^ SizeSeparator {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SizeSeparator : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

CableTraySettings Class

Autodesk.Revit.DB.Electrical Namespace